    
#Использовать "../src"
#Использовать "help"
#Использовать asserts

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт

	МассивТестов = Новый Массив;
	МассивТестов.Добавить("ТестДолжен_ВыполнитьКонвертациюОбработкиВXML");
	МассивТестов.Добавить("ТестДолжен_ОбработатьОшибкуКоманды");
	МассивТестов.Добавить("ТестДолжен_ВыполнитьСинтаксическийКонтроль");

	Возврат МассивТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт

	ПомощникТестирования.СоздатьИБ();

КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт

	ПомощникТестирования.ОчиститьДанныеТестКейса();
	
КонецПроцедуры

#Область ШагиТеста

Процедура ТестДолжен_ВыполнитьКонвертациюОбработкиВXML() Экспорт

	Агент = ПомощникТестирования.СоздатьАгента();

	Каталог = ВременныеФайлы.СоздатьКаталог();
	
	ОбработкаИсходник = ОбъединитьПути(ПомощникТестирования.КаталогФикстур(), "ТестоваяОбработка.epf");
	Обработка = ОбъединитьПути(Каталог, "ТестоваяОбработка.epf");
	КопироватьФайл(ОбработкаИсходник, Обработка);

	Агент.ВыгрузитьВнешнуюОбработкуВXML(Обработка, Каталог);

	Ожидаем.Что(НайтиФайлы(Каталог, "*.xml", Истина).Количество(), "Некорреткное количество файлов выгрузки XML").Равно(3);

КонецПроцедуры

Процедура ТестДолжен_ОбработатьОшибкуКоманды() Экспорт

	Агент = ПомощникТестирования.СоздатьАгента();

	Каталог = ВременныеФайлы.СоздатьКаталог();
	
	Обработка = ОбъединитьПути(Каталог, "ТестоваяОбработка.epf");

	Агент.Подключиться();

	Результат = Агент.ВыгрузитьВнешнуюОбработкуВXML(Обработка, Каталог);

	Ожидаем.Что(Результат, "Ошибочная операция вернула успех").ЭтоЛожь();

КонецПроцедуры

#КонецОбласти

ПередЗапускомТеста();
ТестДолжен_ОбработатьОшибкуКоманды();
ПослеЗапускаТеста();