    
#Использовать "../src"
#Использовать asserts
#Использовать v8find
#Использовать "help"

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт

	МассивТестов = Новый Массив;
	МассивТестов.Добавить("ТестДолжен_ПроверитьСозданиеАгента");
	МассивТестов.Добавить("ТестДолжен_ПроверитьПодключениеКАгенту");
	МассивТестов.Добавить("ТестДолжен_ОбработатьОшибкуНетПодключения");

	Возврат МассивТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт

	ПомощникТестирования.СоздатьИБ();

КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт

	ПомощникТестирования.ОчиститьДанныеТестКейса();

КонецПроцедуры

#Область ШагиТеста

Процедура ТестДолжен_ПроверитьСозданиеАгента() Экспорт

	Агент = ПомощникТестирования.СоздатьАгента();
	Успех = Агент.Подключиться();

	Ожидаем.Что(Успех, "Агент не запущен").ЭтоИстина();

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПодключениеКАгенту() Экспорт

	ПомощникТестирования.СоздатьАгента();

	Агент = ПомощникТестирования.ПодключитьсяКАгенту();

	Если Агент.Подключен() Тогда

		Агент.Отключиться();

	КонецЕсли;

	Ожидаем.Что(Агент.Подключен(), "Не удалось подключиться к агенту").ЭтоИстина();

КонецПроцедуры

Процедура ТестДолжен_ОбработатьОшибкуНетПодключения() Экспорт

	Агент = ПомощникТестирования.СоздатьАгента();

	Результат = Агент.Отключиться();

	Ожидаем.Что(Результат, "Ошибочная операция вернула успех").ЭтоЛожь();

КонецПроцедуры

#КонецОбласти

ПередЗапускомТеста();
ТестДолжен_ПроверитьСозданиеАгента();
ПослеЗапускаТеста();